000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. HELLO-WORLD.
000300* simple hello world program
000400 PROCEDURE DIVISION.
000500    DISPLAY 'Hello world!'.
000600    STOP RUN.
